//--------------------task 1---------------------------//
let admin;
let name;

name = "Джон";
admin = name;
alert(admin);

//----------------------task 2------------------------//
const planetEarth = true;
let currentUser;

//----------------------task 3-----------------------//
//const BIRTHDAY = "18.04.1982";  использовать заглавные буквы? -да, так как дата рождения не может измениться

//const AGE = someCode(BIRTHDAY); а здесь? - я б использовала маленькие буквы, так как это вычисляемое значение.
